![sql](../../static/sql-logo.jpg)

# A guide to databases, SQL, & using them with `pandas`

Let's start with Peter Bell's great blog piece [on relational databases](https://flatironschool.com/blog/an-introduction-to-the-relational-database).

Themes:
- Structured vs. Unstructured Data
- Records (Rows) in Tables in Databases
- Eliminating Redundancy

## Learning goals:
- Goal 1: Summarize the use case for sql in the data science skill set
- Goal 2: Define key sql terminology
- Goal 3: Get information about DB schema and table structure
- Goal 4: Use basic SQL commands:
    - Construct SQL queries
    - Use JOIN to merge tables along logical columns
    - Group Data with SQL
- Goal 5: Query data from pandas dataframes using SQL
- Goal 6: Convert SQL to pandas

## Goal 1: Summarize

[Netflix has a great article](https://medium.com/netflix-techblog/notebook-innovation-591ee3221233) describing three different data roles at their company, their different needs, and their toolsets.

![netflix](../../static/netflix-data-roles.jpeg)

Examining that graphic, SQL shows up as one of the tools of the _Data Engineer_

Data Engineers provide the essential data architecture services that make data science possible.

![hierarchy](../../static/ai-hierachy.png)

[Source: Monica Rogati’s fantastic Medium post “The AI Hierarchy of Needs”
](https://hackernoon.com/the-ai-hierarchy-of-needs-18f111fcc007)

### What is a Relational Database? 

![rdb](../../static/relational-dbms-model.png)
[reference for image ](https://www.studytonight.com/dbms/database-model.php)

### POPULAR RDBMS

- SQLite
- MySQL
- PostgreSql
- Oracle DB
- SQL Server

***
## Goal 2: Database terminology

### Relational Database Schema

![schema](../../static/MySQL_Schema_Music_Example.png)

[source of image](https://database.guide/what-is-a-database-schema/)

This sort of picture is sometimes called an **E**ntity **R**elationship **D**iagram. [Here](https://www.smartdraw.com/entity-relationship-diagram/) is another good resource for explaining typical ERD conventions.

### Table columns view
![table example](../../static/columns.png)

### Terminology

- Schema
    - [An excellent explainer](https://www.youtube.com/watch?v=3BZz8R7mqu0) on db schemas
- Primary Key
- Foreign Key
- Structured queries
- Views

***
### SQLite

![sqlite](../../static/SQLite-Python.jpg)

"SQLite is a C library that provides a lightweight disk-based database that doesn’t require a separate server process and allows accessing the database using a nonstandard variant of the SQL query language. Some applications can use SQLite for internal data storage. It’s also possible to prototype an application using SQLite and then port the code to a larger database such as PostgreSQL or Oracle." - [sqlite documentation](https://docs.python.org/2/library/sqlite3.html)

## Goal 3: Get going with sqlite!

In [1]:
import sqlite3
import os
cd_dot_dot = os.pardir
data_path = os.path.join(cd_dot_dot, cd_dot_dot, 'data')

#### Load a DB object with `connect` and `cursor`

In [2]:
!ls

curriculum.ipynb lesson.ipynb     solution.ipynb

In [3]:
con = sqlite3.connect(os.path.join(data_path,'flights.db'))
cursor = con.cursor()
cursor2 = con.cursor()

#### Use sqlite_master to find all the tables in the schema
Get the schema of a database from a db in sqlite

In [4]:
cursor.execute(
"""
SELECT name
FROM sqlite_master
WHERE type='table';
"""
)

In [5]:
print(cursor.fetchall())

[('airports',), ('airlines',), ('routes',)]

For more on "sqlite_master", see [here](https://www.techonthenet.com/sqlite/sys_tables/index.php).

#### Get information about one table

**A note about** `execute`<br>
Each time you use it, you reset the value of cursor

In [6]:
cursor.execute(
"""
SELECT *
FROM airports
"""
)

#### Use description

In [7]:
cursor.description

(('index', None, None, None, None, None, None),
 ('id', None, None, None, None, None, None),
 ('name', None, None, None, None, None, None),
 ('city', None, None, None, None, None, None),
 ('country', None, None, None, None, None, None),
 ('code', None, None, None, None, None, None),
 ('icao', None, None, None, None, None, None),
 ('latitude', None, None, None, None, None, None),
 ('longitude', None, None, None, None, None, None),
 ('altitude', None, None, None, None, None, None),
 ('offset', None, None, None, None, None, None),
 ('dst', None, None, None, None, None, None),
 ('timezone', None, None, None, None, None, None))

The septuple structure has to do with Python API [compatibility issues](https://kite.com/python/docs/sqlite3.Cursor.description).

#### Making fetch happen

`.fetchall()` is how you get the query results out of the object.

You can also `.fetchone()` or `.fetchmany()`. The latter takes a number of records to return as a parameter.

In [8]:
cursor.fetchmany(10)

[(0,
  '1',
  'Goroka',
  'Goroka',
  'Papua New Guinea',
  'GKA',
  'AYGA',
  '-6.081689',
  '145.391881',
  '5282',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (1,
  '2',
  'Madang',
  'Madang',
  'Papua New Guinea',
  'MAG',
  'AYMD',
  '-5.207083',
  '145.7887',
  '20',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (2,
  '3',
  'Mount Hagen',
  'Mount Hagen',
  'Papua New Guinea',
  'HGU',
  'AYMH',
  '-5.826789',
  '144.295861',
  '5388',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (3,
  '4',
  'Nadzab',
  'Nadzab',
  'Papua New Guinea',
  'LAE',
  'AYNZ',
  '-6.569828',
  '146.726242',
  '239',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (4,
  '5',
  'Port Moresby Jacksons Intl',
  'Port Moresby',
  'Papua New Guinea',
  'POM',
  'AYPY',
  '-9.443383',
  '147.22005',
  '146',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (5,
  '6',
  'Wewak Intl',
  'Wewak',
  'Papua New Guinea',
  'WWK',
  'AYWK',
  '-3.583828',
  '143.669186',
  '19',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (6,
  '7',
  'Narsarsuaq',
  'Narssarssuaq',
  'Greenland',
  'UAK',
  'BGBW',
  '61.160517',
  '-45.425978',
  '112',
  '-3',
  'E',
  'America/Godthab'),
 (7,
  '8',
  'Nuuk',
  'Godthaab',
  'Greenland',
  'GOH',
  'BGGH',
  '64.190922',
  '-51.678064',
  '283',
  '-3',
  'E',
  'America/Godthab'),
 (8,
  '9',
  'Sondre Stromfjord',
  'Sondrestrom',
  'Greenland',
  'SFJ',
  'BGSF',
  '67.016969',
  '-50.689325',
  '165',
  '-3',
  'E',
  'America/Godthab'),
 (9,
  '10',
  'Thule Air Base',
  'Thule',
  'Greenland',
  'THU',
  'BGTL',
  '76.531203',
  '-68.703161',
  '251',
  '-4',
  'E',
  'America/Thule')]

**Task:** Get the descriptive data for airlines and routes tables

In [9]:
cursor.execute(
    """
    SELECT *
    FROM airlines
    """
).description

(('index', None, None, None, None, None, None),
 ('id', None, None, None, None, None, None),
 ('name', None, None, None, None, None, None),
 ('alias', None, None, None, None, None, None),
 ('iata', None, None, None, None, None, None),
 ('icao', None, None, None, None, None, None),
 ('callsign', None, None, None, None, None, None),
 ('country', None, None, None, None, None, None),
 ('active', None, None, None, None, None, None))

In [10]:
cursor.execute(
    """SELECT *
    FROM routes
    """
).description

(('index', None, None, None, None, None, None),
 ('airline', None, None, None, None, None, None),
 ('airline_id', None, None, None, None, None, None),
 ('source', None, None, None, None, None, None),
 ('source_id', None, None, None, None, None, None),
 ('dest', None, None, None, None, None, None),
 ('dest_id', None, None, None, None, None, None),
 ('codeshare', None, None, None, None, None, None),
 ('stops', None, None, None, None, None, None),
 ('equipment', None, None, None, None, None, None))

***
## Goal 4: Use basic SQL commands 
- Construct SQL queries
- Use JOIN to merge tables along logical columns
- Grouping Data with SQL

### Construct SQL queries

**SELECT**

**FROM**

**WHERE**

**GROUP BY**

**ORDER BY**

**LIMIT**

#### Options for each:

**Select**:  `DISTINCT`, using `AS` to rename columns, single number aggregates, `COUNT()` to count, `*` for "all"

**From:** also uses aliasing with `AS`

**Where**: `=`, `BETWEEN`, `IN`, wildcards with `%`, `AND`, `OR`, `NOT` pattern matching with `LIKE` and `ILIKE`

**Order by**: `ASC` and `DESC`

**Limit**:  #

***

**Exercises**:
- Select only active airlines in the United Kingdom from the airlines table <br/>
Hint: The values for 'active' are 'Y' and 'N'.
- Select the unique list of countries with airports

In [11]:
cursor.execute(
"""
SELECT *
FROM airlines
WHERE active = 'Y'
AND country = 'United Kingdom'
"""
).fetchall()[:5]

[(111,
  '112',
  'Astraeus',
  '\\N',
  '5W',
  'AEU',
  'FLYSTAR',
  'United Kingdom',
  'Y'),
 (491,
  '492',
  'Air Southwest',
  '\\N',
  None,
  'WOW',
  'SWALLOW',
  'United Kingdom',
  'Y'),
 (507,
  '508',
  'Aurigny Air Services',
  '\\N',
  'GR',
  'AUR',
  'AYLINE',
  'United Kingdom',
  'Y'),
 (564,
  '565',
  'Air Wales',
  '\\N',
  '6G',
  'AWW',
  'RED DRAGON',
  'United Kingdom',
  'Y'),
 (664,
  '665',
  'AD Aviation',
  '\\N',
  None,
  'VUE',
  'FLIGHTVUE',
  'United Kingdom',
  'Y')]

In [12]:
cursor.execute(
"""
SELECT DISTINCT country
FROM airports
"""
).fetchall()[:5]

[('Papua New Guinea',),
 ('Greenland',),
 ('Iceland',),
 ('Canada',),
 ('Algeria',)]

### SQL Joins

SQL joins can be used to both **add** data to a table and **remove** data from a table.

![venn](../../static/venn.png)

**Exercise**: Write a query that will join the latitude and longitude data from the airports table to the information on the routes table. <br/>
Hint: Which column can serve as the link between the two tables? That is, which column in `airports` can serve as foreign key to `routes`?

In [1]:
cursor.execute(
    """
    SELECT *
    froom airports
    """
).description

NameError: name 'cursor' is not defined

In [14]:
cursor.execute(
    """
    SELECT *
    FROM routes r
    JOIN airports a
    ON a.code = r.dest
    """
).fetchall()[:5]

[(0,
  '2B',
  '410',
  'AER',
  '2965',
  'KZN',
  '2990',
  None,
  '0',
  'CR2',
  2910,
  '2990',
  'Kazan',
  'Kazan',
  'Russia',
  'KZN',
  'UWKD',
  '55.606186',
  '49.278728',
  '411',
  '4',
  'N',
  'Europe/Moscow'),
 (1,
  '2B',
  '410',
  'ASF',
  '2966',
  'KZN',
  '2990',
  None,
  '0',
  'CR2',
  2910,
  '2990',
  'Kazan',
  'Kazan',
  'Russia',
  'KZN',
  'UWKD',
  '55.606186',
  '49.278728',
  '411',
  '4',
  'N',
  'Europe/Moscow'),
 (2,
  '2B',
  '410',
  'ASF',
  '2966',
  'MRV',
  '2962',
  None,
  '0',
  'CR2',
  2883,
  '2962',
  'Mineralnyye Vody',
  'Mineralnye Vody',
  'Russia',
  'MRV',
  'URMM',
  '44.225072',
  '43.081889',
  '1054',
  '4',
  'N',
  'Europe/Moscow'),
 (3,
  '2B',
  '410',
  'CEK',
  '2968',
  'KZN',
  '2990',
  None,
  '0',
  'CR2',
  2910,
  '2990',
  'Kazan',
  'Kazan',
  'Russia',
  'KZN',
  'UWKD',
  '55.606186',
  '49.278728',
  '411',
  '4',
  'N',
  'Europe/Moscow'),
 (4,
  '2B',
  '410',
  'CEK',
  '2968',
  'OVB',
  '4078',
  None,
  '0',
  'CR2',
  3969,
  '4078',
  'Tolmachevo',
  'Novosibirsk',
  'Russia',
  'OVB',
  'UNNT',
  '55.012622',
  '82.650656',
  '365',
  '7',
  'N',
  'Asia/Omsk')]

### Grouping statements

Combines `select` and `group by` when you want aggregates by values

`select` `min(x)` ... `max()`, `sum()`, etc

`group by x`

**Task**<br>
- Which countries have the highest numbers of active airlines?
- Which countries have the highest numbers of inactive airlines?

In [15]:
cursor.execute(
"""
SELECT COUNT() num, country
FROM airlines
WHERE active='Y'
GROUP BY country
HAVING num > 10
ORDER BY num DESC
LIMIT 30
"""
).fetchall()[:3]

[(141, 'United States'), (72, 'Russia'), (40, 'United Kingdom')]

In [16]:
cursor.execute(
"""
SELECT COUNT() num, country
FROM airlines
WHERE active='N'
GROUP BY country
HAVING num > 10
ORDER BY num DESC
LIMIT 30
"""
).fetchall()[:3]

[(939, 'United States'), (427, 'Mexico'), (367, 'United Kingdom')]

**Exercise**: Run a query that will return the number of airports by time zone. Each row should have a number of airports and a time zone.

In [17]:
cursor.execute(
    """
    SELECT COUNT() num, timezone
    FROM airports
    GROUP BY timezone
    ORDER BY num DESC
    """
).fetchall()[:3]

[(628, 'America/New_York'), (373, 'America/Chicago'), (319, 'Europe/Berlin')]

### `CASE WHEN`

`CASE WHEN` is SQL's version of `if ... then ... else`. It must *always* be closed with an `END`.

In [18]:
cursor.execute(
"""
SELECT name, city,
CASE WHEN latitude > 0 THEN 'northern hemisphere'
ELSE 'southern hemisphere'
END AS hemisphere
FROM airports
"""
).fetchall()[:3]

[('Goroka', 'Goroka', 'southern hemisphere'),
 ('Madang', 'Madang', 'southern hemisphere'),
 ('Mount Hagen', 'Mount Hagen', 'southern hemisphere')]

### Subqueries

For more complex queries it can be helpful to break them down into multiple parts. Subqueries are a natural way to do this.

Suppose I wanted to know, after collecting together the highest airport in each country, which one's name comes alphabetically first.

I might break this down by first collecting the highest airports and then _wrapping_ that query in a higher query that selects the name and country I want _from_ the result of that first query:

In [19]:
cursor.execute(
"""
SELECT MIN(name), country FROM
(SELECT name, code, country, MAX(CAST(altitude AS INT))
FROM airports
GROUP BY country)
"""
).fetchall()[:3]

[('Abha', 'Saudi Arabia')]

## Goal 5: Using sql within pandas to filter

`.query()`

[query documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.query.html)

In [20]:
# Get data for an example
import pandas as pd
shelter_data=pd.read_csv('https://data.austintexas.gov/api/\
views/9t4d-g238/rows.csv?accessType=DOWNLOAD')
shelter_data.dtypes

Animal ID           object
Name                object
DateTime            object
MonthYear           object
Date of Birth       object
Outcome Type        object
Outcome Subtype     object
Animal Type         object
Sex upon Outcome    object
Age upon Outcome    object
Breed               object
Color               object
dtype: object

In [21]:
shelter_data[shelter_data['Name'] == "Max"].head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
55,A736717,Max,10/21/2016 02:45:00 PM,10/21/2016 02:45:00 PM,10/16/2013,Return to Owner,NaN,Dog,Neutered Male,3 years,Pug Mix,Brown Brindle
172,A766116,Max,02/13/2018 11:14:00 AM,02/13/2018 11:14:00 AM,02/02/2015,Return to Owner,NaN,Dog,Neutered Male,3 years,Rottweiler/Staffordshire,Blue/Tan
410,A688196,Max,09/16/2014 12:20:00 PM,09/16/2014 12:20:00 PM,09/16/2005,Euthanasia,Suffering,Dog,Neutered Male,9 years,Jack Russell Terrier Mix,Chocolate/White
540,A579608,Max,07/21/2014 12:43:00 PM,07/21/2014 12:43:00 PM,06/09/2010,Return to Owner,NaN,Dog,Neutered Male,4 years,Labrador Retriever Mix,Black/White
873,A745151,Max,03/13/2017 07:12:00 PM,03/13/2017 07:12:00 PM,11/13/2016,Return to Owner,NaN,Dog,Neutered Male,3 months,German Shepherd Mix,White

In [22]:
# With .query()

max_data = shelter_data.query('Name == "Max"')
max_data.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
55,A736717,Max,10/21/2016 02:45:00 PM,10/21/2016 02:45:00 PM,10/16/2013,Return to Owner,NaN,Dog,Neutered Male,3 years,Pug Mix,Brown Brindle
172,A766116,Max,02/13/2018 11:14:00 AM,02/13/2018 11:14:00 AM,02/02/2015,Return to Owner,NaN,Dog,Neutered Male,3 years,Rottweiler/Staffordshire,Blue/Tan
410,A688196,Max,09/16/2014 12:20:00 PM,09/16/2014 12:20:00 PM,09/16/2005,Euthanasia,Suffering,Dog,Neutered Male,9 years,Jack Russell Terrier Mix,Chocolate/White
540,A579608,Max,07/21/2014 12:43:00 PM,07/21/2014 12:43:00 PM,06/09/2010,Return to Owner,NaN,Dog,Neutered Male,4 years,Labrador Retriever Mix,Black/White
873,A745151,Max,03/13/2017 07:12:00 PM,03/13/2017 07:12:00 PM,11/13/2016,Return to Owner,NaN,Dog,Neutered Male,3 months,German Shepherd Mix,White

## Goal 6: Transfering from sqlite to pandas

`.read_sql()`

In [23]:
import pandas as pd
db_path = os.path.join(data_path,'flights.db')
conn = sqlite3.connect(db_path)
df = pd.read_sql("SELECT * FROM airports LIMIT 50", conn)
df.head()

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby

**Exercise for later**: 
Convert one of the earlier queries in the lesson to a pandas data frame

In [24]:
!pip install pandasql

Requirement already satisfied: pandasql in /opt/anaconda3/lib/python3.7/site-packages (0.7.3)
Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.7/site-packages (from pandasql) (1.3.9)
Requirement already satisfied: numpy in /opt/anaconda3/lib/python3.7/site-packages (from pandasql) (1.17.2)
Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.7/site-packages (from pandasql) (1.0.3)
Requirement already satisfied: pytz>=2017.2 in /opt/anaconda3/lib/python3.7/site-packages (from pandas->pandasql) (2019.3)
Requirement already satisfied: python-dateutil>=2.6.1 in /opt/anaconda3/lib/python3.7/site-packages (from pandas->pandasql) (2.8.0)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.7/site-packages (from python-dateutil>=2.6.1->pandas->pandasql) (1.12.0)

`pandasql` is a library that allows SQL-style querying of `pandas` DataFrames.

In [25]:
import pandasql

In [26]:
pandasql.sqldf("SELECT name, code FROM df LIMIT 10", globals())

                         name code
0                      Goroka  GKA
1                      Madang  MAG
2                 Mount Hagen  HGU
3                      Nadzab  LAE
4  Port Moresby Jacksons Intl  POM
5                  Wewak Intl  WWK
6                  Narsarsuaq  UAK
7                        Nuuk  GOH
8           Sondre Stromfjord  SFJ
9              Thule Air Base  THU

## On Your Own

The [Chinook database](https://github.com/lerocha/chinook-database) is a sample database, representing a digital media store.

You need to create a query that can rank tracks in term of popularity.

The name of the database is `Chinook_Sqlite.sqlite`

Database information:<br>
- How many tables are in the database?
- What's the primary key of each table?
- What foreign keys join the tables together?
- If you had to draw a schema of how the tables are connected, what would it look like?

To answer the question:<br>
- What are the max and min dates in the Invoice table?
- What tables would you need to answer "what is your most popular track?"
- What values from each table?